export default {
  // 帐号状态
  appState: {
    1: '在线',
    2: '离线',
    '-1': '封号'
  },
  // 任务状态
  TASK_STATUS: {
    0: '创建成功',
    1: '执行中',
    2: '已结束',
    3: '已取消'
  },
  // 任务详情状态
  TASK_DETAIL_STATUS: {
    0: '未发送',
    1: '已执行',
    2: '发送成功',
    3: '发送失败'
  },
  // 百度翻译相关
  TRANSLATE_LANGUAGES: {
    zh: '中文（简体）',
    en: '英语',
    yue: '粤语',
    wyw: '文言文',
    jp: '日语',
    kor: '韩语',
    fra: '法语',
    spa: '西班牙语',
    th: '泰语',
    ara: '阿拉伯语',
    ru: '俄语',
    pt: '葡萄牙语',
    de: '德语',
    it: '意大利语',
    el: '希腊语',
    nl: '荷兰语',
    pl: '波兰语',
    bul: '保加利亚语',
    est: '爱沙尼亚语',
    dan: '丹麦语',
    fin: '芬兰语',
    cs: '捷克语',
    rom: '罗马尼亚语',
    slo: '斯洛文尼亚语',
    swe: '瑞典语',
    hu: '匈牙利语',
    cht: '繁体中文',
    vie: '越南语'
  }
}
